[ {
  "id": 9,
  "name": "Social Community",
  "titleimage": "../images/socialcommunity_icon2.png",
  "link": "https://social.appsbymarcia.com",
  "github": "https://github.com/MarciaAdler/social",
  "shortdescription": "Social Community is a place where people in communities can come together and share information with their community, on their own platform, with their own rules.",
  "technologies": "React, Bootstrap, Sass, JavaScript, Express, NodeJS, MySQL(Sequelize), APIs"
},
  {
    "id": 8,
    "name": "Community Esse",
    "titleimage": "../images/communityessetitleicon.png",
    "link": "https://community.appsbymarcia.com",
    "github": "https://github.com/MarciaAdler/CommunityEsse",
    "shortdescription": "Complete MERN and CRUD property management app that allows property managers, employees, and tenants to better communicate.",
    "technologies": "React, Bootstrap, Sass, JavaScript, Express, NodeJS, MySQL (Sequelize)"
  },
  {
    "id": 7,
    "name": "SingAlong Karaoke",
    "image": "./images/SingAlong-homepage.png",
    "titleimage": "../images/SingAlong-title.png",
    "link": "https://shrouded-cliffs-43407.herokuapp.com/",
    "github": "https://github.com/MarciaAdler/KaraokeApp",
    "shortdescription": "Search and save your favorite karaoke songs.",
    "description": "SingAlong Karaoke allows users to search for popular karaoke songs.Users can also sign-up and create an account to be able to save favorites for future reference. Users can view information on songs such as genres, release year, lyrics, Youtube lyric videos,if it is a duet and other songs by the same artist.",
    "technologies": "React, Bootstrap, Sass, JavaScript, APIs, Express, NodeJS, MySQL (Sequelize)"
  },
  
  {
    "id": 10,
    "name": "Layla's Game",
    "titleimage": "../images/LaylasGameimage.png",
    "link": "https://game.appsbymarcia.com",
    "github": "https://github.com/MarciaAdler/laylagame",
    "shortdescription": "Kid's games that help them learn and become familiar with math, numbers, words, and letters",
    "technologies": "React, Bootstrap, JavaScript, Express, NodeJS"
  },
  {
    "id": 1,
    "name": "Project 1: hungry much?",
    "image": "./images/projectone.png",
    "titleimage": "../images/hungrymuchtitle.png",
    "link": "https://marciaadler.github.io/ProjectOne/",
    "github": "https://github.com/MarciaAdler/ProjectOne",
    "shortdescription": "Allows users to search for foods and recipes and retrieve nutritional information.",
    "description": "hungry much? is an app that allows users to search for recipes by main ingredient and get a list of recipes that include the main ingredient along with the nutritional information and a link to the recipe.  Users can save recipes for future reference.  Users can also search for food items and get nutritional information per serving for food items",
    "technologies": "HTML, CSS, JavaScript, JQuery, API"
  },
  {
    "id": 2,
    "name": "Google Book Search",
    "image": "../images/googelbooksearch.png",
    "titleimage": "../images/googlebooksearchtitle.png",
    "link": "https://stormy-springs-52175.herokuapp.com/",
    "github": "https://github.com/MarciaAdler/GoogleBooksSearch",
    "shortdescription": "Allows users to search for books by title and save favorites using the Google Book API.",
    "description": "The Google Book Search App allows users to search for books by title using the Google API. When a user searches for a book, they will get back the top 10 results for that book including title, author(s), description, link and image thumbnail. On the search page users can save books to a database and view those saved books on the saved page. On the Saved page, users can delete books from that page.",
    "technologies": "ReactJS, JavaScript, Bootstrap, MongoDB, API, Express, Google Books API"
  },
  {
    "id": 3,
    "name": "Password Generator App",
    "image": "../images/password-generator-app.png",
    "titleimage": "../images/passwordgeneratortitle.png",
    "link": "https://marciaadler.github.io/PasswordGenerator/",
    "github": "https://github.com/MarciaAdler/PasswordGenerator",
    "shortdescription": "Generates unique passwords based on requirements input by users.",
    "description": "The password generator allows users to generate random passwords based on criteria they input through prompts.  Users can input how many characters they want the password to be, and then select if they want special characters, upper or lowercase letters, and numbers to be included.  Once generated, users can copy the password to their computer's clipboard and paste it wherever they'd like.",
    "technologies": "HTML, CSS, JavaScript"
  },
  {
    "id": 4,
    "name": "Day Planner App",
    "image": "../images/dayplannerapp.png",
    "titleimage": "../images/dayplannerapptitle.png",
    "link": "https://marciaadler.github.io/DayPlanner/",
    "github": "https://github.com/MarciaAdler/DayPlanner",
    "shortdescription": "Allows users to input daily activities into a daily planner, save them and then view and update.",
    "description": "The Day Planner allows users to view their daily schedule by hour.  The app color codes the inputs by hours, grey being in the past, red being current, and green in the future.  Users can input their activities into the color coded section and save their inputs to local storage for future reference.",
    "technologies": "HTML, CSS, JavaScript, JQuery"
  },
  {
    "id": 5,
    "name": "Budget Tracker App",
    "image": "../images/budgettrackerapp.png",
    "titleimage": "../images/budgetapptrackertitle.png",
    "link": "https://limitless-island-26284.herokuapp.com/",
    "github": "https://github.com/MarciaAdler/BudgetTracker",
    "shortdescription": "Tracks users incoming and outgoing money activities.",
    "description": "The Budget Tracker App allows users to track their incoming and outgoing payments.  Users are able to input the name of a transcation, the amount, and whether they are adding funds or subtracting funds. Users can then see a list of their transactions, as well as a graph showing their total budget over time.  History is tracker in a database, and the app can be used offline.  Any transactions made while offline will be stored to be processed once a user goes back online.  The app is also designed to be a Progressive Web App (PWA) and is mobile friendly.",
    "technologies": "HTML, CSS, JavaScript, MongoDB, IndexedDB, PWA"
  }
]
